Revit 2026 API

# StructuralAssetConcreteCompression Property

---

The compression strength of concrete-based assets.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ConcreteCompression { get; set; }
```
```vb
Public Property ConcreteCompression As Double
	Get
	Set
```
```cpp
public:
property double ConcreteCompression {
	double get ();
	void set (double value);
}
```
```fsharp
member ConcreteCompression : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be concrete to set this property. |

Applies to concrete-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace